---
kind: method
id: M:Autodesk.Revit.DB.Electrical.WireMaterialTypeSet.GetEnumerator
source: html/509552fc-d5a8-9b58-9552-7032e0643150.htm
---
# Autodesk.Revit.DB.Electrical.WireMaterialTypeSet.GetEnumerator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the set.